#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.linode.data.cloudflare_zone.tld[0]: Reading...
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_ip_ranges.cloudflare: Read complete after 1s [id=2749251940]
module.linode.data.linode_profile.current: Reading...
module.linode.data.linode_profile.current: Read complete after 0s [id=3058147]
module.linode.data.cloudflare_zone.tld[0]: Read complete after 1s [id=017c917b6192840fba99275cf8b69774]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.linode.cloudflare_record.ipv4[0] will be created
  + resource "cloudflare_record" "ipv4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "nextcloud"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "017c917b6192840fba99275cf8b69774"
    }

  # module.linode.linode_firewall.instance_firewall will be created
  + resource "linode_firewall" "instance_firewall" {
      + devices         = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + inbound_policy  = "DROP"
      + label           = "Nextcloud"
      + linodes         = (known after apply)
      + outbound_policy = "DROP"
      + status          = (known after apply)

      + inbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "103.21.244.0/22",
              + "103.22.200.0/22",
              + "103.31.4.0/22",
              + "104.16.0.0/13",
              + "104.24.0.0/14",
              + "108.162.192.0/18",
              + "131.0.72.0/22",
              + "141.101.64.0/18",
              + "162.158.0.0/15",
              + "172.64.0.0/13",
              + "173.245.48.0/20",
              + "188.114.96.0/20",
              + "190.93.240.0/20",
              + "197.234.240.0/22",
              + "198.41.128.0/17",
            ]
          + ipv6     = [
              + "2400:cb00::/32",
              + "2405:8100::/32",
              + "2405:b500::/32",
              + "2606:4700::/32",
              + "2803:f800::/32",
              + "2a06:98c0::/29",
              + "2c0f:f248::/32",
            ]
          + label    = "allow-https-from-cloudflare"
          + ports    = "443"
          + protocol = "TCP"
        }

      + outbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-https-egress"
          + ports    = "443"
          + protocol = "TCP"
        }
      + outbound {
          + action   = "ACCEPT"
          + ipv4     = [
              + "0.0.0.0/0",
            ]
          + ipv6     = [
              + "::/0",
            ]
          + label    = "allow-dns-lookup"
          + ports    = "53"
          + protocol = "TCP"
        }
    }

  # module.linode.linode_instance.instance will be created
  + resource "linode_instance" "instance" {
      + backups            = (known after apply)
      + backups_enabled    = true
      + boot_config_label  = "boot_config"
      + booted             = (known after apply)
      + group              = "Productivity"
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + label              = "Nextcloud"
      + private_ip         = false
      + private_ip_address = (known after apply)
      + region             = "eu-west"
      + resize_disk        = false
      + shared_ipv4        = (known after apply)
      + specs              = (known after apply)
      + status             = (known after apply)
      + swap_size          = (known after apply)
      + type               = "g6-standard-1"
      + watchdog_enabled   = true

      + alerts {
          + cpu            = (known after apply)
          + io             = (known after apply)
          + network_in     = (known after apply)
          + network_out    = (known after apply)
          + transfer_quota = (known after apply)
        }

      + config {
          + kernel      = "linode/latest-64bit"
          + label       = "boot_config"
          + root_device = "/dev/sda"
          + run_level   = "default"
          + virt_mode   = "paravirt"

          + devices {
              + sda {
                  + disk_id    = (known after apply)
                  + disk_label = "boot"
                }

              + sdb {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sdc {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sdd {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sde {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sdf {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sdg {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }

              + sdh {
                  + disk_id    = (known after apply)
                  + disk_label = (known after apply)
                  + volume_id  = (known after apply)
                }
            }

          + helpers {
              + devtmpfs_automount = (known after apply)
              + distro             = (known after apply)
              + modules_dep        = (known after apply)
              + network            = (known after apply)
              + updatedb_disabled  = (known after apply)
            }
        }

      + disk {
          + authorized_users = [
              + "batinica-ci",
            ]
          + filesystem       = (known after apply)
          + id               = (known after apply)
          + image            = "linode/ubuntu22.04"
          + label            = "boot"
          + read_only        = (known after apply)
          + size             = 50000
          + stackscript_data = (sensitive value)
          + stackscript_id   = (known after apply)
        }
    }

  # module.linode.linode_stackscript.instance_boot_command[0] will be created
  + resource "linode_stackscript" "instance_boot_command" {
      + created             = (known after apply)
      + deployments_active  = (known after apply)
      + deployments_total   = (known after apply)
      + description         = "Used to configure the Nextcloud instance on boot"
      + id                  = (known after apply)
      + images              = [
          + "linode/ubuntu22.04",
        ]
      + is_public           = false
      + label               = "Nextcloud boot configuration"
      + script              = <<-EOT
            #!/usr/bin/env bash
            snap install nextcloud && snap run nextcloud.enable-https self-signed
        EOT
      + updated             = (known after apply)
      + user_defined_fields = (known after apply)
      + user_gravatar_id    = (known after apply)
      + username            = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @batinicaz, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*